cases/05_navier_stokes_equation/20_triangular_cavity_projection_Re100_hybrid160/N160/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  14
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    movingTop
    {
        type            patch;
        physicalType    patch;
        nFaces          8;
        startFace       43308;
    }
    rightWall
    {
        type            patch;
        physicalType    patch;
        nFaces          8;
        startFace       43316;
    }
    leftWall
    {
        type            patch;
        physicalType    patch;
        nFaces          8;
        startFace       43324;
    }
    front
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          28811;
        startFace       43332;
    }
    back
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          28811;
        startFace       72143;
    }
)

// ************************************************************************* //
