cases/05_navier_stokes_equation/20_triangular_cavity_projection_Re100_hybrid160/N160/constant/C
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  14
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    location    "constant";
    object      C;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<vector> 
28811
(
(0.758758237824 -0.0539681810357 0.05)
(-0.536366716803 -0.0530151430476 0.05)
(0.330367299097 -0.0534452621079 0.05)
(-0.966321248155 -0.0533082147904 0.05)
(-0.445011030156 -0.062805315871 0.05)
(-0.412068407819 -0.0618847374286 0.05)
(0.0170130570522 -0.0619538091582 0.05)
(0.446164816254 -0.0619582810087 0.05)
...
)
;

boundaryField
{
    movingTop
    {
        type            calculated;
        value           nonuniform List<vector> 8((-1.08253175473 0 0.05) (-1.51554445662 0 0.05) (-0.649519052841 0 0.05) (-0.21650635095 0 0.05) (0.216506350942 0 0.05) (0.649519052836 0 0.05) (1.08253175473 0 0.05) (1.51554445662 0 0.05));
    }
    rightWall
    {
        type            calculated;
        value           nonuniform List<vector> 8((1.40729128115 -0.562499999998 0.05) (1.6237976321 -0.187499999999 0.05) (1.19078493021 -0.937499999996 0.05) (0.97427857926 -1.3125 0.05) (0.757772228314 -1.6875 0.05) (0.541265877367 -2.0625 0.05) (0.32475952642 -2.4375 0.05) (0.108253175473 -2.8125 0.05));
    }
    leftWall
    {
        type            calculated;
        value           nonuniform List<vector> 8((-0.324759526418 -2.4375 0.05) (-0.108253175473 -2.8125 0.05) (-0.541265877364 -2.0625 0.05) (-0.757772228309 -1.6875 0.05) (-0.974278579255 -1.3125 0.05) (-1.1907849302 -0.937500000003 0.05) (-1.40729128115 -0.562500000002 0.05) (-1.6237976321 -0.187500000001 0.05));
    }
    front
    {
        type            empty;
    }
    back
    {
        type            empty;
    }
}


// ************************************************************************* //
