cases/05_navier_stokes_equation/20_triangular_cavity_projection_Re100_hybrid160/N160/constant/Ccy
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  14
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "constant";
    object      Ccy;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<scalar> 
28811
(
-0.0539681810357
-0.0530151430476
-0.0534452621079
-0.0533082147904
-0.062805315871
-0.0618847374286
-0.0619538091582
-0.0619582810087
...
)
;

boundaryField
{
    movingTop
    {
        type            calculated;
        value           uniform 0;
    }
    rightWall
    {
        type            calculated;
        value           nonuniform List<scalar> 8(-0.562499999998 -0.187499999999 -0.937499999996 -1.3125 -1.6875 -2.0625 -2.4375 -2.8125);
    }
    leftWall
    {
        type            calculated;
        value           nonuniform List<scalar> 8(-2.4375 -2.8125 -2.0625 -1.6875 -1.3125 -0.937500000003 -0.562500000002 -0.187500000001);
    }
    front
    {
        type            empty;
    }
    back
    {
        type            empty;
    }
}


// ************************************************************************* //
